# Вам будет дан список чисел через пробел.
# Напишите программу, которая подсчитывает количество уникальных значений в этом списке.

numbers = [1, 1, 2, 2, 3, 3, 4, 4, 5, 5]
kol = 1
for i in numbers:
    if numbers[i] == numbers[i+1]:
        kol += 1
        print(numbers[i], numbers[i+1])
print(kol)
